# 02. Cleaning the Data and Pre-processing it
***

In the previous chapter, we've got familiar with the data by exploring it. In this chapter, we will clean the data and pre-process it in order to apply the different learning algorithms.

In [185]:
import numpy as np
import pandas as pd

In [186]:
# Import the data
original_data = pd.read_csv('./data/train.csv')
data = original_data

In [187]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

***
## Step 1: Drop unnecessary features and samples

Not all the features/variables/attributes are necessary to create our predictive models. We will drop them:

In [188]:
# Drop unnecessary features
data = data.drop(['PassengerId', 'Name', 'Ticket', 'Cabin'], axis = 1)

In [189]:
data.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [190]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Sex         891 non-null object
Age         714 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Fare        891 non-null float64
Embarked    889 non-null object
dtypes: float64(2), int64(4), object(2)
memory usage: 55.8+ KB

Concerning the samples, there are missing values for `Sex` attribute and `Embarked`. Missing `Sex` values can be estimated, but unfortunately, missing `Embarked` values cannot:

In [191]:
data[data['Embarked'].isnull()]

     Survived  Pclass     Sex   Age  SibSp  Parch  Fare Embarked
61          1       1  female  38.0      0      0  80.0      NaN
829         1       1  female  62.0      0      0  80.0      NaN

As we can see, `Embarked` values cannot be guessed or approximated using other attributes. Better dropping them.

In [192]:
data = data.drop(data[data['Embarked'].isnull()].index, axis = 0)

In [193]:
data.shape

(889, 8)

This confirms the dropping of the two samples without the `Embarked` information. We will now reindex the data frame.

In [194]:
data = data.reset_index(drop = True)

***
## Step 2: Convert categorical variables Sex and Embarked to numerical variables

The `Sex` and `Embarked` attributes can't be handled by our predictive algorithms because they are strings. We will convert them to integers:

In [195]:
# Converting Sex to Gender with the following mapping: 0 = female, 1 = male
data['Gender'] = data['Sex'].map({ 'female': 0, 'male': 1 }).astype(int)

In [196]:
data.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked  Gender
0         0       3    male  22.0      1      0   7.2500        S       1
1         1       1  female  38.0      1      0  71.2833        C       0
2         1       3  female  26.0      0      0   7.9250        S       0
3         1       1  female  35.0      1      0  53.1000        S       0
4         0       3    male  35.0      0      0   8.0500        S       1

`Embarked` variable is different from `Sex`. `Sex` variable can only takes two values, which bac be converted to 0 and 1. But `Embarked` variable takes 3 different categorical values. If they are converted to arbitrary numerical values, we are creating continuity and ordering in a variable that doesn't have these properties. That's why it is better to convert this variable to 3 dummy variables, with only 0 and 1 values.

In [197]:
# Converting Embarked to Boarding variables using dummy variables
boardings = pd.get_dummies(data['Embarked'], prefix = 'Boarding').astype(int)

In [198]:
data = data.join(boardings)

In [199]:
data.head()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Gender,Boarding_C,Boarding_Q,Boarding_S
0,0,3,male,22.0,1,0,7.2500,S,1,0,0,1
1,1,1,female,38.0,1,0,71.2833,C,0,1,0,0
2,1,3,female,26.0,0,0,7.9250,S,0,0,0,1
3,1,1,female,35.0,1,0,53.1000,S,0,0,0,1
4,0,3,male,35.0,0,0,8.0500,S,1,0,0,1

We can now drop the categorical attributes `Sex` and `Embarked`:

In [200]:
data = data.drop(['Sex', 'Embarked'], axis = 1)

In [201]:
data.head()

,Survived,Pclass,Age,SibSp,Parch,Fare,Gender,Boarding_C,Boarding_Q,Boarding_S
0,0,3,22.0,1,0,7.2500,1,0,0,1
1,1,1,38.0,1,0,71.2833,0,1,0,0
2,1,3,26.0,0,0,7.9250,0,0,0,1
3,1,1,35.0,1,0,53.1000,0,0,0,1
4,0,3,35.0,0,0,8.0500,1,0,0,1

In [202]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 889 entries, 0 to 888
Data columns (total 10 columns):
Survived      889 non-null int64
Pclass        889 non-null int64
Age           712 non-null float64
SibSp         889 non-null int64
Parch         889 non-null int64
Fare          889 non-null float64
Gender        889 non-null int64
Boarding_C    889 non-null int64
Boarding_Q    889 non-null int64
Boarding_S    889 non-null int64
dtypes: float64(2), int64(8)
memory usage: 69.5 KB

***
## Step 3: Filling missing data

As we have seen before, the only missing values are `Age` values. They can be approximated using the mean of similar passengers, given the passenger class and gender.

In [203]:
data_by_class_and_gender = data.groupby(['Pclass', 'Gender'])

In [204]:
for names, groups in data_by_class_and_gender:
    print names
    print groups.head(3)

(1, 0)
    Survived  Pclass   Age  SibSp  Parch     Fare  Gender  Boarding_C  \
1          1       1  38.0      1      0  71.2833       0           1
3          1       1  35.0      1      0  53.1000       0           0
11         1       1  58.0      0      0  26.5500       0           0

    Boarding_Q  Boarding_S
1            0           0
3            0           1
11           0           1
(1, 1)
    Survived  Pclass   Age  SibSp  Parch      Fare  Gender  Boarding_C  \
6          0       1  54.0      0      0   51.8625       1           0
23         1       1  28.0      0      0   35.5000       1           0
27         0       1  19.0      3      2  263.0000       1           0

    Boarding_Q  Boarding_S
6            0           1
23           0           1
27           0           1
(2, 0)
    Survived  Pclass   Age  SibSp  Parch     Fare  Gender  Boarding_C  \
9          1       2  14.0      1      0  30.0708       0           1
15         1       2  55.0      0      0  16.0000       0           0
41         0       2  27.0      1      0  21.0000       0           0

    Boarding_Q  Boarding_S
9            0           0
15           0           1
41           0           1
(2, 1)
    Survived  Pclass   Age  SibSp  Parch  Fare  Gender  Boarding_C  \
17         1       2   NaN      0      0  13.0       1           0
20         0       2  35.0      0      0  26.0       1           0
21         1       2  34.0      0      0  13.0       1           0

    Boarding_Q  Boarding_S
17           0           1
20           0           1
21           0           1
(3, 0)
    Survived  Pclass   Age  SibSp  Parch     Fare  Gender  Boarding_C  \
2          1       3  26.0      0      0   7.9250       0           0
8          1       3  27.0      0      2  11.1333       0           0
10         1       3   4.0      1      1  16.7000       0           0

    Boarding_Q  Boarding_S
2            0           1
8            0           1
10           0           1
(3, 1)
   Survived  Pclass   Age  SibSp  Parch    Fare  Gender  Boarding_C  \
0         0       3  22.0      1      0  7.2500       1           0
4         0       3  35.0      0      0  8.0500       1           0
5         0       3   NaN      0      0  8.4583       1           0

   Boarding_Q  Boarding_S
0           0           1
4           0           1
5           1           0

In [205]:
# Get the mean age in each group
mean_age_per_group = data_by_class_and_gender['Age'].mean()
mean_age_per_group

Pclass  Gender
1       0         34.240964
        1         41.281386
2       0         28.722973
        1         30.740707
3       0         21.750000
        1         26.507589
Name: Age, dtype: float64

In [206]:
# Example
print mean_age_per_group[1, 0]
print mean_age_per_group[2, 1]

34.2409638554
30.7407070707

Now that we have the mean ages in each class and gender, we will fill missing values with these approximations:

In [207]:
# Create an alternative attribute to fill ages
data['EstimatedAge'] = data['Age']
data.head()

,Survived,Pclass,Age,SibSp,Parch,Fare,Gender,Boarding_C,Boarding_Q,Boarding_S,EstimatedAge
0,0,3,22.0,1,0,7.2500,1,0,0,1,22.0
1,1,1,38.0,1,0,71.2833,0,1,0,0,38.0
2,1,3,26.0,0,0,7.9250,0,0,0,1,26.0
3,1,1,35.0,1,0,53.1000,0,0,0,1,35.0
4,0,3,35.0,0,0,8.0500,1,0,0,1,35.0

In [208]:
data[data['Age'].isnull()].head()

,Survived,Pclass,Age,SibSp,Parch,Fare,Gender,Boarding_C,Boarding_Q,Boarding_S,EstimatedAge
5,0,3,NaN,0,0,8.4583,1,0,1,0,NaN
17,1,2,NaN,0,0,13.0000,1,0,0,1,NaN
19,1,3,NaN,0,0,7.2250,0,1,0,0,NaN
26,0,3,NaN,0,0,7.2250,1,1,0,0,NaN
28,1,3,NaN,0,0,7.8792,0,0,1,0,NaN

In [209]:
for c in range(3): # This is the class of passenger
    for g in range(2): # This is the gender of passenger
        data.loc[(data['Age'].isnull()) & (data['Pclass'] == (c + 1)) & (data['Gender'] == g), 'EstimatedAge'] = \
        mean_age_per_group[c + 1, g]

In [210]:
print len(data[data['Age'].isnull()])
print len(data[data['EstimatedAge'].isnull()])

177
0

In [211]:
data[data['Age'].isnull()].head() # Missing Age values

,Survived,Pclass,Age,SibSp,Parch,Fare,Gender,Boarding_C,Boarding_Q,Boarding_S,EstimatedAge
5,0,3,NaN,0,0,8.4583,1,0,1,0,26.507589
17,1,2,NaN,0,0,13.0000,1,0,0,1,30.740707
19,1,3,NaN,0,0,7.2250,0,1,0,0,21.750000
26,0,3,NaN,0,0,7.2250,1,1,0,0,26.507589
28,1,3,NaN,0,0,7.8792,0,0,1,0,21.750000

In [212]:
data[~data['Age'].isnull()].head() # Not missing Age values

,Survived,Pclass,Age,SibSp,Parch,Fare,Gender,Boarding_C,Boarding_Q,Boarding_S,EstimatedAge
0,0,3,22.0,1,0,7.2500,1,0,0,1,22.0
1,1,1,38.0,1,0,71.2833,0,1,0,0,38.0
2,1,3,26.0,0,0,7.9250,0,0,0,1,26.0
3,1,1,35.0,1,0,53.1000,0,0,0,1,35.0
4,0,3,35.0,0,0,8.0500,1,0,0,1,35.0

And voila! We can see that we filled missing age values with an estimation of the age based on the passenger class and gender, and we just kept the age when it isn't missing.

We can now drop the original `Age` attribute and change `EstimatedAge` attribute name into `Age`:

In [213]:
data = data.drop(['Age'], axis = 1)

In [214]:
data = data.rename(columns = {'EstimatedAge': 'Age'})

In [215]:
data.head()

,Survived,Pclass,SibSp,Parch,Fare,Gender,Boarding_C,Boarding_Q,Boarding_S,Age
0,0,3,1,0,7.2500,1,0,0,1,22.0
1,1,1,1,0,71.2833,0,1,0,0,38.0
2,1,3,0,0,7.9250,0,0,0,1,26.0
3,1,1,1,0,53.1000,0,0,0,1,35.0
4,0,3,0,0,8.0500,1,0,0,1,35.0

In [216]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 889 entries, 0 to 888
Data columns (total 10 columns):
Survived      889 non-null int64
Pclass        889 non-null int64
SibSp         889 non-null int64
Parch         889 non-null int64
Fare          889 non-null float64
Gender        889 non-null int64
Boarding_C    889 non-null int64
Boarding_Q    889 non-null int64
Boarding_S    889 non-null int64
Age           889 non-null float64
dtypes: float64(2), int64(8)
memory usage: 69.5 KB

***
## Step 4: Convert the categorical Pclass variable into numerical dummy variables

There is another hidden categorical variable: Pclass. Even if Pclass takes numerical values, it has a categorical meaning: First class passengers, second class passengers and third class passengers. In no way, there is a meaning in the continuity of the values: 2nd class passengers don't necessarily have half chance of survival than first class passengers. Yes they have less chance, but not necessarily half the chance!

That's why it is better to consider splitting the Pclass variable into three different dummy variables to allow each passenger class to have its specific weight in the final prediction.

In [217]:
# Converting Pclass to dummy variables
pclass = pd.get_dummies(data['Pclass'], prefix = 'Pclass').astype(int)
data = data.join(pclass)
data.head()

,Survived,Pclass,SibSp,Parch,Fare,Gender,Boarding_C,Boarding_Q,Boarding_S,Age,Pclass_1,Pclass_2,Pclass_3
0,0,3,1,0,7.2500,1,0,0,1,22.0,0,0,1
1,1,1,1,0,71.2833,0,1,0,0,38.0,1,0,0
2,1,3,0,0,7.9250,0,0,0,1,26.0,0,0,1
3,1,1,1,0,53.1000,0,0,0,1,35.0,1,0,0
4,0,3,0,0,8.0500,1,0,0,1,35.0,0,0,1

In [218]:
# Drop the original Pclass variable
data = data.drop('Pclass', axis = 1)

In [219]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 889 entries, 0 to 888
Data columns (total 12 columns):
Survived      889 non-null int64
SibSp         889 non-null int64
Parch         889 non-null int64
Fare          889 non-null float64
Gender        889 non-null int64
Boarding_C    889 non-null int64
Boarding_Q    889 non-null int64
Boarding_S    889 non-null int64
Age           889 non-null float64
Pclass_1      889 non-null int64
Pclass_2      889 non-null int64
Pclass_3      889 non-null int64
dtypes: float64(2), int64(10)
memory usage: 83.4 KB

***
### Calculate the correlation martix on the cleaned training dataset

In [221]:
data.corr()

,Survived,SibSp,Parch,Fare,Gender,Boarding_C,Boarding_Q,Boarding_S,Age,Pclass_1,Pclass_2,Pclass_3
Survived,1.000000,-0.034040,0.083151,0.255290,-0.541585,0.169966,0.004536,-0.151777,-0.072689,0.282368,0.095002,-0.320171
SibSp,-0.034040,1.000000,0.414542,0.160887,-0.116348,-0.060074,-0.026692,0.069438,-0.250693,-0.052894,-0.056507,0.091515
Parch,0.083151,0.414542,1.000000,0.217532,-0.247508,-0.011588,-0.081585,0.061512,-0.179671,-0.015809,-0.001278,0.014634
Fare,0.255290,0.160887,0.217532,1.000000,-0.179958,0.270731,-0.116684,-0.163758,0.115165,0.590576,-0.117609,-0.411932
Gender,-0.541585,-0.116348,-0.247508,-0.179958,1.000000,-0.084520,-0.075217,0.121405,0.118678,-0.093142,-0.066459,0.134227
Boarding_C,0.169966,-0.060074,-0.011588,0.270731,-0.084520,1.000000,-0.148646,-0.782613,0.043103,0.299472,-0.126039,-0.154785
Boarding_Q,0.004536,-0.026692,-0.081585,-0.116684,-0.075217,-0.148646,1.000000,-0.499261,-0.083226,-0.154680,-0.127705,0.237035
Boarding_S,-0.151777,0.069438,0.061512,-0.163758,0.121405,-0.782613,-0.499261,1.000000,0.014625,-0.165022,0.190824,-0.013594
Age,-0.072689,-0.250693,-0.179671,0.115165,0.118678,0.043103,-0.083226,0.014625,1.000000,0.382204,0.024656,-0.348692
Pclass_1,0.282368,-0.052894,-0.015809,0.590576,-0.093142,0.299472,-0.154680,-0.165022,0.382204,1.000000,-0.287653,-0.625395
Pclass_2,0.095002,-0.056507,-0.001278,-0.117609,-0.066459,-0.126039,-0.127705,0.190824,0.024656,-0.287653,1.000000,-0.567432
Pclass_3,-0.320171,0.091515,0.014634,-0.411932,0.134227,-0.154785,0.237035,-0.013594,-0.348692,-0.625395,-0.567432,1.000000

In [222]:
original_data.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

Comparing the two correlation matrices (before cleaning and after cleaning the data), we can notice that the dependance between survival and the other attributes doesn't change a lot. We just added four more attributes to the study: the filled `Age` and the dummy variables on `Boarding` and `Pclass`.

***
## Step 5: Cleaning the test dataset the same way with training dataset

This is in case the test dataset is provided in a separate file, like in this example. In general, the test dataset is provided with the training dataset as a whole. One need to split the dataset into a training and a testing datasets, using different methods, like the `train_test_split` method of `sklearn.cross_validation` module.

Here we are going to clean the test dataset like we did for the training dataset. We will save the dataset into a CSV file for further use.

In [239]:
test = pd.read_csv('./data/test.csv')
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [240]:
test.head(3)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q

In [241]:
test = test.drop(['PassengerId', 'Name', 'Ticket', 'Cabin'], axis = 1)
test.head(3)

   Pclass     Sex   Age  SibSp  Parch    Fare Embarked
0       3    male  34.5      0      0  7.8292        Q
1       3  female  47.0      1      0  7.0000        S
2       2    male  62.0      0      0  9.6875        Q

In [242]:
test['Gender'] = test['Sex'].map({ 'female': 0, 'male': 1}).astype(int)
test = test.drop('Sex', axis = 1)
test.head(3)

   Pclass   Age  SibSp  Parch    Fare Embarked  Gender
0       3  34.5      0      0  7.8292        Q       1
1       3  47.0      1      0  7.0000        S       0
2       2  62.0      0      0  9.6875        Q       1

In [243]:
test = test.join(pd.get_dummies(test['Embarked'], prefix = 'Boarding').astype(int))
test = test.drop('Embarked', axis = 1)
test.head(3)

,Pclass,Age,SibSp,Parch,Fare,Gender,Boarding_C,Boarding_Q,Boarding_S
0,3,34.5,0,0,7.8292,1,0,1,0
1,3,47.0,1,0,7.0000,0,0,0,1
2,2,62.0,0,0,9.6875,1,0,1,0

In [244]:
test = test.join(pd.get_dummies(test['Pclass'], prefix = 'Pclass').astype(int))
test = test.drop('Pclass', axis = 1)
test.head(3)

,Age,SibSp,Parch,Fare,Gender,Boarding_C,Boarding_Q,Boarding_S,Pclass_1,Pclass_2,Pclass_3
0,34.5,0,0,7.8292,1,0,1,0,0,0,1
1,47.0,1,0,7.0000,0,0,0,1,0,0,1
2,62.0,0,0,9.6875,1,0,1,0,0,1,0

In [245]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
Age           332 non-null float64
SibSp         418 non-null int64
Parch         418 non-null int64
Fare          417 non-null float64
Gender        418 non-null int64
Boarding_C    418 non-null int64
Boarding_Q    418 non-null int64
Boarding_S    418 non-null int64
Pclass_1      418 non-null int64
Pclass_2      418 non-null int64
Pclass_3      418 non-null int64
dtypes: float64(2), int64(9)
memory usage: 36.0 KB

Here we have missing values `Age` like what we had for the training dataset. We are not going to fill them with estimates nor drop them for two reasons:

1. some learning algorithms can handle missing values
2. we can't alter values of the testing dataset, otherwise we are corrupting the model testing

In [246]:
test.to_csv('./data/test_clean.csv', index = False)

***
## Step 6: Splitting the training dataset into two datasets to feed learning algorithms

The training dataset that was provided by Kaggle and cleaned before needs to be splitted into two other datasets: A new training dataset (subset of the full training dataset), that will be used to create the learning model, and a test dataset (different from the test dataset provided by Kaggle) to judge the accuracy/score of the learning model.

In the next chapters, when we will build the learning models, we will always use this new training dataset. We will also always use the new testing dataset to judge each model score in the same way, which help us compare the models.

But before that, we need to split the whole training dataset into two groups with same target mean, so we can effectively say that our two groups are similar.

In [258]:
from sklearn.cross_validation import train_test_split

X = data.drop('Survived', axis = 1)
Y = data['Survived']
epsilon = 1

# Here epsilon will help us select the best split to have the same proportion of survivors
# among training and testing datasets
while epsilon >= 0.01:
    X_train, X_test, Y_train, Y_test = train_test_split(X, Y, train_size = 0.8)
    epsilon = np.abs( np.mean(Y_train) - np.mean(Y_test))

In [259]:
print np.mean(Y_train)
print np.mean(Y_test)

0.381153305204
0.387640449438

In [260]:
data_train = X_train.join(Y_train)
data_train.head()

,SibSp,Parch,Fare,Gender,Boarding_C,Boarding_Q,Boarding_S,Age,Pclass_1,Pclass_2,Pclass_3,Survived
198,0,0,13.0000,0,0,0,1,24.000000,0,1,0,0
346,1,0,16.1000,0,0,0,1,21.750000,0,0,1,1
173,0,0,30.6958,1,1,0,0,56.000000,1,0,0,0
594,1,1,24.1500,1,0,0,1,36.000000,0,0,1,0
523,0,0,7.2292,1,1,0,0,26.507589,0,0,1,0

In [261]:
data_test = X_test.join(Y_test)
data_test.head()

,SibSp,Parch,Fare,Gender,Boarding_C,Boarding_Q,Boarding_S,Age,Pclass_1,Pclass_2,Pclass_3,Survived
769,0,0,9.50,1,0,0,1,24.000000,0,0,1,0
297,0,0,30.50,1,0,0,1,41.281386,1,0,0,1
236,0,2,26.25,0,0,0,1,8.000000,0,1,0,1
263,0,0,7.75,0,0,1,0,21.750000,0,0,1,0
497,1,2,151.55,0,0,0,1,25.000000,1,0,0,0

In [263]:
# Finally save the datasets into CSV for future use
data_train.to_csv('./data/training_dataset.csv', index = False)
data_test.to_csv('./data/testing_dataset.csv', index = False)